In [2]:
people = {
    "first":["Corey", "Jane", "John", "Adam"],
    "last":["Schafer", "Doe", "Doe", "Doe"],
    "email":["CodeyMSchafer@gmail.com" , "JaneDoe@email.com", "JohnDoe@email.com", "A@email.com"]
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CodeyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [6]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
3         Adam Doe
dtype: object

In [7]:
df['fullname'] = df['first'] + ' ' + df['last']

In [8]:
df

   first     last                    email       fullname
0  Corey  Schafer  CodeyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe
3   Adam      Doe              A@email.com       Adam Doe

In [10]:
df.drop(columns=['first', 'last'], inplace=True)

In [11]:
df

                     email       fullname
0  CodeyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe
3              A@email.com       Adam Doe

In [13]:
df['fullname'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3   Adam      Doe

In [14]:
df[['first', 'last']]= df['fullname'].str.split(' ', expand=True)

In [15]:
df

                     email       fullname  first     last
0  CodeyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3              A@email.com       Adam Doe   Adam      Doe

In [24]:
new_row = {'first': 'Tony'}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

In [25]:
df

                     email       fullname  first     last
0  CodeyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3              A@email.com       Adam Doe   Adam      Doe
4                      NaN            NaN   Tony      NaN

In [26]:
people = {
    "first":["Tony", "Steve"],
    "last":["Stark", "Rogers"],
    "email":["IronMan@avenge.com" , "Cap@avenge.com"]
}

In [27]:
df2 = pd.DataFrame(people)

In [28]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [31]:
df = pd.concat([df, df2], ignore_index=True)

In [32]:
df

                     email       fullname  first     last
0  CodeyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3              A@email.com       Adam Doe   Adam      Doe
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers

In [33]:
df.drop(index=4)

                     email       fullname  first     last
0  CodeyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3              A@email.com       Adam Doe   Adam      Doe
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers

In [46]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email       fullname  first     last
0  CodeyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers